<!--
/*************************************************************************
* @ 서비스경로 : 공통
* @ 페이지설명 : 404에러 라우터 리다이렉트 처리
                기본적으로 서버에서 체크해서 리다이렉트 시켜주지만 
                화면단에서도 처리로직을 넣음
* @ 파일명     : src/views/page/CO/CO/COCO1127/COCO1127.vue
* @ 작성자     : CS515731
* @ 작성일     : 2021-05-18
************************** 수정이력 ****************************************
* 날짜                    작업자                 변경내용
*_________________________________________________________________________
* 2021-06-25             CS515729                 최초작성
*************************************************************************/
-->
<template>
			<h1>Page Not Found</h1>
</template>

<script>

export default {
  name: 'COCO1127',

  mounted() {
    sessionStorage.clear()
    location.href = '/error/404Error.html'
  },
}
</script>