<!--
/*************************************************************************
* @ 서비스경로 : 콕마이데이터설정 > 대면상담 일회성동의
* @ 페이지설명 : 콕마이데이터설정 > 대면상담 일회성동의 > [필수]상품추천 동의약관
* @ 파일명     : src/views/page/CO/OR/COOR4204/COOR4204.vue
* @ 작성자     : CS541013
* @ 작성일     : 2025-05-12
************************** 수정이력 ****************************************
* 날짜                    작업자                변경내용
*_________________________________________________________________________
* 2025-05-12              CS541013              최초작성
*************************************************************************/
-->
<template>
    <!-- full popup S -->
	<div class="full_popup" id="full_popup_01">
		<div class="popup_header">
			<h1>[필수] 상품추천 동의</h1>
		</div>
		<div class="popup_content">
			<div class="terms_view">
				<div>
					<strong class="terms_tit">[필수] 상품추천 동의</strong>
					<div class="terms_cont">
						약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.약관내용입니다.
					</div>
				</div>
			</div>
		</div>
		<div class="popup_footer fixed">
			<!-- 개별 -->
			<div class="btns_wrap">
				<a href="#nolink" class="btns lg" id="btnMoveAgree">맨 밑으로 내리기</a>
			</div>
			<!-- //개별 -->
		</div>
		<a href="javascript:void(0);" class="btn_close" @click.prevent="close()"><span class="blind">팝업닫기</span></a>
	</div>
	<!--// full popup E -->
</template>

<script>
import Page from '@/views/layout/Page.vue'
import FootersV2 from '@/views/layout/FootersV2.vue'
import modalService from '@/service/modalService'
import commonMixin from '@/common/mixins/commonMixin'
import commonService from '@/service/commonService'
import apiService from '@/service/apiService'
import popupMixin from '@/common/mixins/popupMixin'

export default {
    name : "COOR4204",
	data: () => {
        return {
            
		}
	},
	computed: {
		
	},
	mixins: [
        commonMixin,
        popupMixin
    ],
	methods: {
		
	},
    watch: {
        
    },
	components: {
		Page,
        FootersV2
	}
}
</script>